### Planned Changes to Shared Infrastructure
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
time_rotating.yearly: Refreshing state... [id=2023-06-12T09:16:03Z]
random_string.resource_code: Refreshing state... [id=altht]
module.tfstate.random_string.resource_code: Refreshing state... [id=1dyqh]
module.remote_state.random_string.resource_code: Refreshing state... [id=yn8h4]
data.azurerm_subscription.current: Reading...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.shared: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/shared]
azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/tfstate]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
github_actions_variable.azure_subscription_id: Refreshing state... [id=indok-api:AZURE_SUBSCRIPTION_ID]
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e]
azurerm_role_definition.custom_contributor: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/providers/Microsoft.Authorization/roleDefinitions/eb538aa6-9be8-04d8-67e6-c1794972fa98|/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e]
azurerm_key_vault.shared: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/shared/providers/Microsoft.KeyVault/vaults/shared-key-vault-altht]
data.azuread_application_published_app_ids.well_known: Reading...
module.remote_state.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/shared/providers/Microsoft.Storage/storageAccounts/tfstateyn8h4]
azuread_application.grafana: Refreshing state... [id=/applications/7a026ebe-de8b-4daf-9d2e-426b370bb825]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
azuread_service_principal.msgraph: Refreshing state... [id=/servicePrincipals/a88adec8-ea1a-4bb2-9a70-9a1d7fb56dfe]
module.tfstate.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/tfstate/providers/Microsoft.Storage/storageAccounts/tfstate1dyqh]
azuread_application_password.grafana: Refreshing state... [id=7a026ebe-de8b-4daf-9d2e-426b370bb825/password/b4883a6a-e363-4f65-92b3-6d2417f8e3f1]
azuread_service_principal.grafana: Refreshing state... [id=/servicePrincipals/7a7aa8d3-cc5a-4dce-b718-866cae82d59d]
azuread_application.github: Refreshing state... [id=/applications/383093fc-e3db-4bc0-b66a-c6b92ba05f3b]
azurerm_role_assignment.grafana_subscription_reader: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/providers/Microsoft.Authorization/roleAssignments/b15fe720-9b46-4e12-c492-8ab70a4ce483]
azurerm_key_vault_secret.external["feide-client-secret"]: Refreshing state... [id=https://shared-key-vault-altht.vault.azure.net/secrets/feide-client-secret/7772d04dd7c04aa5a27426d4b2ab1443]
azurerm_role_assignment.admin_user_key_vault_officer["aebaf770-f990-4042-ba63-0bad65e6a23e"]: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/shared/providers/Microsoft.KeyVault/vaults/shared-key-vault-altht/providers/Microsoft.Authorization/roleAssignments/397310a9-aec8-63a0-4497-013cf5b5c5dc]
azurerm_key_vault_secret.external["postmark-api-token"]: Refreshing state... [id=https://shared-key-vault-altht.vault.azure.net/secrets/postmark-api-token/549f4fd0dea744e6bb86ce6cadc2000a]
azuread_application_federated_identity_credential.github_environment_production: Refreshing state... [id=383093fc-e3db-4bc0-b66a-c6b92ba05f3b/federatedIdentityCredential/18fed092-4ba4-42da-96b0-c5229a20e666]
github_actions_variable.azure_client_id: Refreshing state... [id=indok-api:AZURE_CLIENT_ID]
azuread_application_federated_identity_credential.github_pull_request: Refreshing state... [id=383093fc-e3db-4bc0-b66a-c6b92ba05f3b/federatedIdentityCredential/647d9158-e0cf-4958-9a9b-5a875a14703c]
azuread_application_federated_identity_credential.github_branch_main: Refreshing state... [id=383093fc-e3db-4bc0-b66a-c6b92ba05f3b/federatedIdentityCredential/6b4176b7-7e9d-4fb6-a8a4-901736798cdd]
azuread_service_principal.github: Refreshing state... [id=/servicePrincipals/cb1576bb-2618-45a0-8363-0575d7e7e412]
azuread_application_password.github: Refreshing state... [id=383093fc-e3db-4bc0-b66a-c6b92ba05f3b/password/2cd2d5a6-6260-4d8c-9e2c-962efc8d7f6c]
github_actions_variable.azure_tenant_id: Refreshing state... [id=indok-api:AZURE_TENANT_ID]
azuread_app_role_assignment.github_users_read_all: Refreshing state... [id=/servicePrincipals/a88adec8-ea1a-4bb2-9a70-9a1d7fb56dfe/appRoleAssignedTo/u3YVyxgmoEWDYwV11-fkEqSwn-9eFSNKrvmbIIfDmf8]
azurerm_role_assignment.key_vault_officer: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/providers/Microsoft.Authorization/roleAssignments/53c4825b-a9f6-817f-3fe2-c4224e0c1ed8]
azurerm_role_assignment.github_subscription_contributor: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/providers/Microsoft.Authorization/roleAssignments/fed3ebc1-f401-be0c-33f7-25c37837f14e]
azuread_app_role_assignment.github_app_rw_all: Refreshing state... [id=/servicePrincipals/a88adec8-ea1a-4bb2-9a70-9a1d7fb56dfe/appRoleAssignedTo/u3YVyxgmoEWDYwV11-fkEkPQpibF6g1JpfrQTq4-AZ4]
github_actions_secret.azure_client_secret: Refreshing state... [id=indok-api:AZURE_CLIENT_SECRET]
module.tfstate.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstate1dyqh.blob.core.windows.net/tfstate]
module.remote_state.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstateyn8h4.blob.core.windows.net/tfstate]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # time_rotating.yearly has been deleted
  - resource "time_rotating" "yearly" {
      - id               = "2023-06-12T09:16:03Z" -> null
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # azuread_application_password.github must be replaced
+/- resource "azuread_application_password" "github" {
      ~ end_date            = "2025-06-12T09:24:18.0844902Z" -> (known after apply)
      ~ id                  = "383093fc-e3db-4bc0-b66a-c6b92ba05f3b/password/2cd2d5a6-6260-4d8c-9e2c-962efc8d7f6c" -> (known after apply)
      ~ key_id              = "2cd2d5a6-6260-4d8c-9e2c-962efc8d7f6c" -> (known after apply)
      ~ rotate_when_changed = {
          - "rotation" = "2023-06-12T09:16:03Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-06-12T09:24:18.0844902Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # azuread_application_password.grafana must be replaced
+/- resource "azuread_application_password" "grafana" {
      ~ end_date            = "2025-11-28T10:12:23.7774715Z" -> (known after apply)
      ~ id                  = "7a026ebe-de8b-4daf-9d2e-426b370bb825/password/b4883a6a-e363-4f65-92b3-6d2417f8e3f1" -> (known after apply)
      ~ key_id              = "b4883a6a-e363-4f65-92b3-6d2417f8e3f1" -> (known after apply)
      ~ rotate_when_changed = {
          - "rotation" = "2023-06-12T09:16:03Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-11-28T10:12:23.7774715Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.azure_client_secret must be replaced
-/+ resource "github_actions_secret" "azure_client_secret" {
      ~ created_at      = "2023-11-28 10:09:27 +0000 UTC" -> (known after apply)
      ~ id              = "indok-api:AZURE_CLIENT_SECRET" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-28 10:09:27 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # time_rotating.yearly will be created
  + resource "time_rotating" "yearly" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_rfc3339 = (known after apply)
      + rotation_years   = 1
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.remote_state.azurerm_storage_account.tfstate will be updated in-place
  ~ resource "azurerm_storage_account" "tfstate" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/shared/providers/Microsoft.Storage/storageAccounts/tfstateyn8h4"
        name                               = "tfstateyn8h4"
        tags                               = {
            "environment" = "shared"
        }
        # (95 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.tfstate.azurerm_storage_account.tfstate will be updated in-place
  ~ resource "azurerm_storage_account" "tfstate" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/tfstate/providers/Microsoft.Storage/storageAccounts/tfstate1dyqh"
        name                               = "tfstate1dyqh"
        tags                               = {
            "environment" = "shared"
        }
        # (95 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*